{
    "format": "layers-model",
    "generatedBy": "keras v2.1.6-tf",
    "convertedBy": "TensorFlow.js Converter v2.0.1.post1",
    "modelTopology": {
        "keras_version": "2.1.6-tf",
        "backend": "tensorflow",
        "model_config": {
            "class_name": "Sequential",
            "config": {
                "name": "sequential_11",
                "layers": [
                    {
                        "class_name": "Conv2D",
                        "config": {
                            "name": "conv2d_22",
                            "trainable": true,
                            "batch_input_shape": [
                                null,
                                32,
                                32,
                                3
                            ],
                            "dtype": "float32",
                            "filters": 10,
                            "kernel_size": [
                                3,
                                3
                            ],
                            "strides": [
                                1,
                                1
                            ],
                            "padding": "valid",
                            "data_format": "channels_last",
                            "dilation_rate": [
                                1,
                                1
                            ],
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null,
                                    "dtype": "float32"
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {
                                    "dtype": "float32"
                                }
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        }
                    },
                    {
                        "class_name": "MaxPooling2D",
                        "config": {
                            "name": "max_pooling2d_21",
                            "trainable": true,
                            "dtype": "float32",
                            "pool_size": [
                                2,
                                2
                            ],
                            "padding": "valid",
                            "strides": [
                                2,
                                2
                            ],
                            "data_format": "channels_last"
                        }
                    },
                    {
                        "class_name": "Conv2D",
                        "config": {
                            "name": "conv2d_23",
                            "trainable": true,
                            "dtype": "float32",
                            "filters": 10,
                            "kernel_size": [
                                3,
                                3
                            ],
                            "strides": [
                                1,
                                1
                            ],
                            "padding": "valid",
                            "data_format": "channels_last",
                            "dilation_rate": [
                                1,
                                1
                            ],
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null,
                                    "dtype": "float32"
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {
                                    "dtype": "float32"
                                }
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        }
                    },
                    {
                        "class_name": "MaxPooling2D",
                        "config": {
                            "name": "max_pooling2d_22",
                            "trainable": true,
                            "dtype": "float32",
                            "pool_size": [
                                2,
                                2
                            ],
                            "padding": "valid",
                            "strides": [
                                2,
                                2
                            ],
                            "data_format": "channels_last"
                        }
                    },
                    {
                        "class_name": "Flatten",
                        "config": {
                            "name": "flatten_11",
                            "trainable": true,
                            "dtype": "float32",
                            "data_format": "channels_last"
                        }
                    },
                    {
                        "class_name": "Dense",
                        "config": {
                            "name": "dense_22",
                            "trainable": true,
                            "dtype": "float32",
                            "units": 10,
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null,
                                    "dtype": "float32"
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {
                                    "dtype": "float32"
                                }
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        }
                    },
                    {
                        "class_name": "Dense",
                        "config": {
                            "name": "dense_23",
                            "trainable": true,
                            "dtype": "float32",
                            "units": 3,
                            "activation": "softmax",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null,
                                    "dtype": "float32"
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {
                                    "dtype": "float32"
                                }
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        }
                    }
                ]
            }
        },
        "training_config": {
            "optimizer_config": {
                "class_name": "Adam",
                "config": {
                    "lr": 0.0010000000474974513,
                    "beta_1": 0.8999999761581421,
                    "beta_2": 0.9990000128746033,
                    "decay": 0.0,
                    "epsilon": 1e-07,
                    "amsgrad": false
                }
            },
            "loss": "categorical_crossentropy",
            "metrics": [
                "accuracy"
            ],
            "weighted_metrics": null,
            "sample_weight_mode": null,
            "loss_weights": null
        }
    },
    "weightsManifest": [
        {
            "paths": [
                "group1-shard1of1.bin"
            ],
            "weights": [
                {
                    "name": "conv2d_22/kernel",
                    "shape": [
                        3,
                        3,
                        3,
                        10
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "conv2d_22/bias",
                    "shape": [
                        10
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "conv2d_23/kernel",
                    "shape": [
                        3,
                        3,
                        10,
                        10
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "conv2d_23/bias",
                    "shape": [
                        10
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "dense_22/kernel",
                    "shape": [
                        360,
                        10
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "dense_22/bias",
                    "shape": [
                        10
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "dense_23/kernel",
                    "shape": [
                        10,
                        3
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "dense_23/bias",
                    "shape": [
                        3
                    ],
                    "dtype": "float32"
                }
            ]
        }
    ]
}